app/Http/Controllers/Admin/API/ApiCategoryController.php

    public function index()
    {
        $data = Service_categories::all();
---
select * from `service_categories` where `service_categories`.`deleted_at` is null