app/Http/Controllers/Admin/API/ApiServiceController.php

    public function index()
    {
        $data = Service::query()->with('images')->get();
---
select * from `services` where `services`.`deleted_at` is null

    public function destroy(string $id)
    {
        $data = Service::find($id);
        $data->delete();
---
select * from `services` where `services`.`id` = '4' and `services`.`deleted_at` is null limit 1
update `services` set `deleted_at` = '2023-10-09 03:22:28', `services`.`updated_at` = '2023-10-09 03:22:28' where `id` = 4

    public function getImage(string $id){
        $dataService = Service::query()
            ->with('images')
            ->where('id',$id)->first();
---
select * from `services` where `id` = '3' and `services`.`deleted_at` is null limit 1