app/Http/Controllers/Admin/API/ApiTrashController.php

select * from `service_categories` where `service_categories`.`deleted_at` is not null
---
    public function category()
    {
        $data = Service_categories::onlyTrashed()->get();