app/Http/Controllers/Client/API/BaseApiController.php

select * from `services` where `services`.`deleted_at` is null
---
    public function loadService()
    {
        $data = $this->modelChooService::query()->with('service')->get();
        $service = $this->imgService::query()->with('images')->get();

insert into `bookings` (`user_id`, `stylist_id`, `timesheet_id`, `date`, `special_requirement`, `is_consultant`, `is_accept_take_a_photo`, `status`) values (1, '1', '2', '2023-10-09', '1', '1', '1', 1)
insert into `booking_services` (`booking_id`, `service_id`) values (16, '4')
---
    public function pullRequest(Request $request)
    {
        $user = 1;
        Log::info($request->is_accept_take_a_photo);
//        dd(12);
        $booking = Booking::create([
            'user_id' => $user,
            'stylist_id' => $request->stylist,
            'timesheet_id' => $request->time,
            'date' => $request->date,
            'special_requirement' => $request->specialRequirement,
            'is_consultant' => $request->is_consultant,
            'is_accept_take_a_photo' => $request->isAcceptTakeAPhoto,
            'status' => 1,
        ]);
        $id = $booking->id;
        $service = $request->arrayIDService;
        foreach ($service as $value) {
            Booking_service::create([
                'booking_id' => $id,
                'service_id' => $value,
            ]);