app/Http/Controllers/Client/API/BookingController.php

select `timesheets`.*, `stylist_time_sheets`.`stylist_id` as `pivot_stylist_id`, `stylist_time_sheets`.`timesheet_id` as `pivot_timesheet_id` from `timesheets` inner join `stylist_time_sheets` on `timesheets`.`id` = `stylist_time_sheets`.`timesheet_id` where `stylist_time_sheets`.`stylist_id` in (3)
select * from `timesheets`
---
    public function timeSheetDetail(string $id)
    {
        $dataStylist = $this->model::query()->with('timeSheet')->where('id',$id)->first();
        $dataTimeSheet = Timesheet::all();