app/Http/Controllers/Admin/BannerSettingCtl.php

select * from `banners` where `banners`.`id` = '1' and `banners`.`deleted_at` is null limit 1
update `banners` set `key` = 'a2', `image` = 'image/1696835677z4661804495320_dc6bc95d976b9d8c7c1dd653d6f74af6.jpg', `banners`.`updated_at` = '2023-10-09 07:14:48' where `id` = '1' and `banners`.`deleted_at` is null
---
        function uploadFile2($nameFolder, $file)
        {
            $fileName = time() . '' . $file->getClientOriginalName();
            return $file->storeAS($nameFolder, $fileName, 'public');
        }
        $data = Banner::findOrFail($id);

        if ($request->isMethod('POST')) {

            $params = $request->except('_token');
            if ($request->hasFile('image') && $request->file('image')->isValid()) {
                $resultDL = Storage::delete('/public/' . $data->image);
                if ($resultDL) {
                    $request->image = uploadFile2('image', $request->file('image'));
                    $params['image'] =  $request->image;
                }
            } else {
                $params['image'] = $data->image;
            }

            $result = Banner::where('id', $id)->update($params);